Revit 2027 API
EdgeEndPoint.Evaluate Method
 Evaluate the end point of the edge in 3d coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Evaluate()
Public Function Evaluate As XYZ
public:
XYZ^ Evaluate()
member Evaluate : unit -> XYZ
Return Value
XYZ
 The end point of the edge in 3d coordinates.
Exceptions
Exception | Condition
InvalidOperationException |  Failed to evaluate the end point of the edge.
See Also
Reference
EdgeEndPoint Class
Autodesk.Revit.DB Namespace